# Layoffs Analysis

The project aim was to derive insights from a `layoffs` dataset using SQL for extensive **data cleaning**.

In [1]:
%load_ext sql

In [2]:
%sql mysql+pymysql://root: **** @localhost:3306/worldlayoffs
# Connecting to the database

'Connected: root@worldlayoffs'

In [3]:
%%sql
SHOW TABLES;

 * mysql+pymysql://root:***@localhost:3306/worldlayoffs
1 rows affected.

[('layoffs',)]

## Data Cleaning

- To make sure our data is ready for analysis, we ought to:
1. Remove Duplicates
2. Standardize the data
3. Handle null and blank values
4. Remove any columns and rows

In [4]:
%%sql
# Checking the data overview
SELECT * FROM layoffs 
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/worldlayoffs
5 rows affected.

[('Atlassian', 'Sydney', 'Other', 500, '0.05', '3/6/2023', 'Post-IPO', 'Australia', 210),
 ('SiriusXM', 'New York City', 'Media', 475, '0.08', '3/6/2023', 'Post-IPO', 'United States', 525),
 ('Alerzo', 'Ibadan', 'Retail', 400, None, '3/6/2023', 'Series B', 'Nigeria', 16),
 ('UpGrad', 'Mumbai', 'Education', 120, None, '3/6/2023', 'Unknown', 'India', 631),
 ('Loft', 'Sao Paulo', 'Real Estate', 340, '0.15', '3/3/2023', 'Unknown', 'Brazil', 788)]

The first step is to duplicate the data from the original `layoffs` table to create the `layoffs_staging table`. This approach allows for modifications and editing within the layoffs_staging table without affecting the original dataset.

In this notebook, the `%%capture cap --no-stderr` code is used to improve readability by omitting the *ResourceCodeError* ouput.

In [6]:
%%capture cap --no-stderr
%%sql
CREATE TABLE layoffs_staging
LIKE layoffs;
print("Layoffs_stagging table created successfully.")

In [7]:
%%capture cap --no-stderr
%%sql
INSERT INTO layoffs_staging
SELECT * FROM layoffs;
print('Data inserted succesfully')

In [8]:
%%sql
SELECT * FROM layoffs_staging
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/worldlayoffs
5 rows affected.

[('Atlassian', 'Sydney', 'Other', 500, '0.05', '3/6/2023', 'Post-IPO', 'Australia', 210),
 ('SiriusXM', 'New York City', 'Media', 475, '0.08', '3/6/2023', 'Post-IPO', 'United States', 525),
 ('Alerzo', 'Ibadan', 'Retail', 400, None, '3/6/2023', 'Series B', 'Nigeria', 16),
 ('UpGrad', 'Mumbai', 'Education', 120, None, '3/6/2023', 'Unknown', 'India', 631),
 ('Loft', 'Sao Paulo', 'Real Estate', 340, '0.15', '3/3/2023', 'Unknown', 'Brazil', 788)]

### Task 1. Remove Duplicates

First, create a unique row identifier (using the window functions).

In [9]:
%%sql
SELECT *,
ROW_NUMBER() OVER (
	PARTITION BY company, location, industry, percentage_laid_off, `date`) AS row_num
FROM layoffs_staging
LIMIT 10;

 * mysql+pymysql://root:***@localhost:3306/worldlayoffs
10 rows affected.

[(' E Inc.', 'Toronto', 'Transportation', None, None, '12/16/2022', 'Post-IPO', 'Canada', None, 1),
 (' Included Health', 'SF Bay Area', 'Healthcare', None, '0.06', '7/25/2022', 'Series E', 'United States', 272, 1),
 ('&Open', 'Dublin', 'Marketing', 9, '0.09', '11/17/2022', 'Series A', 'Ireland', 35, 1),
 ('#Paid', 'Toronto', 'Marketing', 19, '0.17', '1/27/2023', 'Series B', 'Canada', 21, 1),
 ('100 Thieves', 'Los Angeles', 'Consumer', 12, None, '7/13/2022', 'Series C', 'United States', 120, 1),
 ('100 Thieves', 'Los Angeles', 'Retail', None, None, '1/10/2023', 'Series C', 'United States', 120, 1),
 ('10X Genomics', 'SF Bay Area', 'Healthcare', 100, '0.08', '8/4/2022', 'Post-IPO', 'United States', 242, 1),
 ('1stdibs', 'New York City', 'Retail', 70, '0.17', '4/2/2020', 'Series D', 'United States', 253, 1),
 ('2TM', 'Sao Paulo', 'Crypto', 90, '0.12', '6/1/2022', 'Unknown', 'Brazil', 250, 1),
 ('2TM', 'Sao Paulo', 'Crypto', 100, '0.15', '9/1/2022', 'Unknown', 'Brazil', 250, 1)]

In [10]:
%%sql
# Partition by each row to help determine the number duplicates.
WITH duplicate_cte AS (
	SELECT *,
		ROW_NUMBER() OVER (
			PARTITION BY company, location, industry, total_laid_off, percentage_laid_off, `date`, stage, country, funds_raised_millions) AS row_num
	FROM layoffs_staging)
SELECT * FROM duplicate_cte 
WHERE row_num >1;

 * mysql+pymysql://root:***@localhost:3306/worldlayoffs
5 rows affected.

[('Casper', 'New York City', 'Retail', None, None, '9/14/2021', 'Post-IPO', 'United States', 339, 2),
 ('Cazoo', 'London', 'Transportation', 750, '0.15', '6/7/2022', 'Post-IPO', 'United Kingdom', 2000, 2),
 ('Hibob', 'Tel Aviv', 'HR', 70, '0.3', '3/30/2020', 'Series A', 'Israel', 45, 2),
 ('Wildlife Studios', 'Sao Paulo', 'Consumer', 300, '0.2', '11/28/2022', 'Unknown', 'Brazil', 260, 2),
 ('Yahoo', 'SF Bay Area', 'Consumer', 1600, '0.2', '2/9/2023', 'Acquired', 'United States', 6, 2)]

To remove the duplicate values, copy the data above in a new table and remove the duplicate values from the created table.

In [11]:
%%capture cap --no-stderr
%%sql
# Creating a new table - layoffs_staging2
CREATE TABLE `layoffs_staging2` (
  `company` text,
  `location` text,
  `industry` text,
  `total_laid_off` int DEFAULT NULL,
  `percentage_laid_off` text,
  `date` text,
  `stage` text,
  `country` text,
  `funds_raised_millions` int DEFAULT NULL,
  `row_num` INT 
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
print('Table successfully created')

In [13]:
%%capture cap --no-stderr
%%sql
# Populating data in the layoffs_staging2
INSERT INTO layoffs_staging2
SELECT *,
ROW_NUMBER() OVER ( 
    PARTITION BY company, location, industry, total_laid_off, percentage_laid_off, `date`, stage, country, funds_raised_millions) AS row_num
FROM layoffs_staging;
print('Data successfully inserted')

In [14]:
%%sql
# Assessing the new table overview
SELECT * FROM layoffs_staging2
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/worldlayoffs
5 rows affected.

[(' E Inc.', 'Toronto', 'Transportation', None, None, '12/16/2022', 'Post-IPO', 'Canada', None, 1),
 (' Included Health', 'SF Bay Area', 'Healthcare', None, '0.06', '7/25/2022', 'Series E', 'United States', 272, 1),
 ('&Open', 'Dublin', 'Marketing', 9, '0.09', '11/17/2022', 'Series A', 'Ireland', 35, 1),
 ('#Paid', 'Toronto', 'Marketing', 19, '0.17', '1/27/2023', 'Series B', 'Canada', 21, 1),
 ('100 Thieves', 'Los Angeles', 'Consumer', 12, None, '7/13/2022', 'Series C', 'United States', 120, 1)]

In [15]:
%%capture cap --no-stderr
%%sql
# Deleting the duplicate values
DELETE FROM layoffs_staging2
WHERE row_num > 1;
print('Duplicated values succesfully deleted')

In [16]:
%%sql
SELECT * FROM layoffs_staging2
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/worldlayoffs
5 rows affected.

[(' E Inc.', 'Toronto', 'Transportation', None, None, '12/16/2022', 'Post-IPO', 'Canada', None, 1),
 (' Included Health', 'SF Bay Area', 'Healthcare', None, '0.06', '7/25/2022', 'Series E', 'United States', 272, 1),
 ('&Open', 'Dublin', 'Marketing', 9, '0.09', '11/17/2022', 'Series A', 'Ireland', 35, 1),
 ('#Paid', 'Toronto', 'Marketing', 19, '0.17', '1/27/2023', 'Series B', 'Canada', 21, 1),
 ('100 Thieves', 'Los Angeles', 'Consumer', 12, None, '7/13/2022', 'Series C', 'United States', 120, 1)]

From this task, it would have been easier to delete the duplicate value if there was a unique column. Since there was no any unique identifier, creating the identifier column helped delete the duplicate records successfully.

### Task 2. Standardize the data
This step involves finding issues in the data and fixing it. <br>
It is advisable to check column by column to confirm whether there are any issues.

In [17]:
%%sql
# Assessing the company column
# The company column contains white spaces, 
SELECT company, TRIM(company) as trimmed_company
FROM layoffs_staging2 
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/worldlayoffs
5 rows affected.

[(' E Inc.', 'E Inc.'),
 (' Included Health', 'Included Health'),
 ('&Open', '&Open'),
 ('#Paid', '#Paid'),
 ('100 Thieves', '100 Thieves')]

In [18]:
%%capture cap --no-stderr
%%sql
# Updating the table to remove the white spaces from company column.
UPDATE layoffs_staging2
SET company = TRIM(company);
print('company column updated')

In [19]:
%%sql
# Assessing the industry column
# From the industry column, we need to make sure the names are consistent when refering to the same industry
# From the query below we can see that the crypto industry is written differently and hence may create confusion.
SELECT DISTINCT industry 
FROM layoffs_staging2
ORDER BY 1
LIMIT 10;

 * mysql+pymysql://root:***@localhost:3306/worldlayoffs
10 rows affected.

[(None,),
 ('',),
 ('Aerospace',),
 ('Construction',),
 ('Consumer',),
 ('Crypto',),
 ('Crypto Currency',),
 ('CryptoCurrency',),
 ('Data',),
 ('Education',)]

In [20]:
%%sql
SELECT * FROM layoffs_staging2
WHERE industry LIKE 'Crypto%'
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/worldlayoffs
5 rows affected.

[('2TM', 'Sao Paulo', 'Crypto', 90, '0.12', '6/1/2022', 'Unknown', 'Brazil', 250, 1),
 ('2TM', 'Sao Paulo', 'Crypto', 100, '0.15', '9/1/2022', 'Unknown', 'Brazil', 250, 1),
 ('Abra', 'SF Bay Area', 'Crypto', 12, '0.05', '6/30/2022', 'Series C', 'United States', 106, 1),
 ('Amber Group', 'Hong Kong', 'Crypto', None, '0.1', '9/9/2022', 'Series B', 'Hong Kong', 328, 1),
 ('Autograph', 'Los Angeles', 'Crypto', None, None, '12/16/2022', 'Series B', 'United States', 205, 1)]

In [21]:
%%capture cap --no-stderr
%%sql
# Updating the crypto industry is to create consistency
UPDATE layoffs_staging2
SET industry = 'Crypto'
WHERE industry LIKE 'Crypto%';
print('Crypto industry updated')

In [22]:
%%sql
# Confirm that the data has been updated succesfully
SELECT DISTINCT industry 
FROM layoffs_staging2
ORDER BY 1
LIMIT 6;

 * mysql+pymysql://root:***@localhost:3306/worldlayoffs
6 rows affected.

[(None,), ('',), ('Aerospace',), ('Construction',), ('Consumer',), ('Crypto',)]

In [23]:
%%sql
# Assessing the country column
SELECT DISTINCT country FROM  layoffs_staging2
ORDER BY 1 DESC
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/worldlayoffs
5 rows affected.

[('Vietnam',),
 ('Uruguay',),
 ('United States.',),
 ('United States',),
 ('United Kingdom',)]

From the output above there is an extra row representing the united states. This needs to be removed.

In [24]:
%%sql
# Removing the extra country with trailing fullstop. 
SELECT DISTINCT TRIM(TRAILING '.' FROM country) as Trimmed_country
FROM layoffs_staging2
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/worldlayoffs
5 rows affected.

[('Canada',), ('United States',), ('Ireland',), ('Brazil',), ('Australia',)]

In [25]:
%%capture cap --no-stderr
%%sql
UPDATE layoffs_staging2 
SET country = TRIM(TRAILING '.' FROM country)
WHERE country LIKE 'United States%';
print('United States updated')

In [26]:
%%sql
# re-assessing the country column
SELECT DISTINCT country FROM  layoffs_staging2
ORDER BY 1 DESC
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/worldlayoffs
5 rows affected.

[('Vietnam',),
 ('Uruguay',),
 ('United States',),
 ('United Kingdom',),
 ('United Arab Emirates',)]

In [27]:
%%sql
# Assessing the date column 
# Change the the text data type to date data type in this column
SELECT `date`, STR_TO_DATE(`date`, '%m/%d/%Y') as formatted_date
FROM layoffs_staging2
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/worldlayoffs
5 rows affected.

[('12/16/2022', datetime.date(2022, 12, 16)),
 ('7/25/2022', datetime.date(2022, 7, 25)),
 ('11/17/2022', datetime.date(2022, 11, 17)),
 ('1/27/2023', datetime.date(2023, 1, 27)),
 ('7/13/2022', datetime.date(2022, 7, 13))]

In [29]:
%%capture cap --no-stderr
%%sql
# Updating the date column with the new format
UPDATE layoffs_staging2 
SET `date` = STR_TO_DATE(`date`, '%m/%d/%Y');
print('Date format updated')

In [30]:
%%capture cap --no-stderr
%%sql
# Updating the Date column to the DATE data type
ALTER TABLE layoffs_staging2
MODIFY COLUMN `date` DATE; 
print('Date data type updated')

In [31]:
%%sql
# Checking the updated table so far 
SELECT * FROM layoffs_staging2
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/worldlayoffs
5 rows affected.

[('E Inc.', 'Toronto', 'Transportation', None, None, datetime.date(2022, 12, 16), 'Post-IPO', 'Canada', None, 1),
 ('Included Health', 'SF Bay Area', 'Healthcare', None, '0.06', datetime.date(2022, 7, 25), 'Series E', 'United States', 272, 1),
 ('&Open', 'Dublin', 'Marketing', 9, '0.09', datetime.date(2022, 11, 17), 'Series A', 'Ireland', 35, 1),
 ('#Paid', 'Toronto', 'Marketing', 19, '0.17', datetime.date(2023, 1, 27), 'Series B', 'Canada', 21, 1),
 ('100 Thieves', 'Los Angeles', 'Consumer', 12, None, datetime.date(2022, 7, 13), 'Series C', 'United States', 120, 1)]

### Task 3. Null values and blank values

In [32]:
%%sql
SELECT * FROM layoffs_staging2 
WHERE total_laid_off IS NULL
	AND percentage_laid_off IS NULL
LIMIT 10;

 * mysql+pymysql://root:***@localhost:3306/worldlayoffs
10 rows affected.

[('E Inc.', 'Toronto', 'Transportation', None, None, datetime.date(2022, 12, 16), 'Post-IPO', 'Canada', None, 1),
 ('100 Thieves', 'Los Angeles', 'Retail', None, None, datetime.date(2023, 1, 10), 'Series C', 'United States', 120, 1),
 ('Accolade', 'Seattle', 'Healthcare', None, None, datetime.date(2023, 3, 3), 'Post-IPO', 'United States', 458, 1),
 ('Ada', 'Toronto', 'Support', None, None, datetime.date(2023, 2, 1), 'Series C', 'Canada', 190, 1),
 ('Adara', 'SF Bay Area', 'Travel', None, None, datetime.date(2020, 3, 31), 'Series C', 'United States', 67, 1),
 ('Addi', 'Bogota', 'Finance', None, None, datetime.date(2022, 6, 14), 'Series C', 'Colombia', 376, 1),
 ('AirMap', 'Los Angeles', 'Aerospace', None, None, datetime.date(2020, 4, 30), 'Unknown', 'United States', 75, 1),
 ('Airtasker', 'Sydney', 'Consumer', None, None, datetime.date(2022, 7, 4), 'Series C', 'Australia', 26, 1),
 ('Akerna', 'Denver', 'Logistics', None, None, datetime.date(2022, 5, 27), 'Unknown', 'United States', 46, 1),
 ('Akerna', 'Denver', 'Logistics', None, None, datetime.date(2020, 9, 2), 'Post-IPO', 'United States', None, 1)]

In [33]:
%%sql
#Checking the null and blank values from the industry column
SELECT * 
FROM layoffs_staging2 
WHERE industry IS NULL 
	OR industry = ''
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/worldlayoffs
5 rows affected.

[('Airbnb', 'SF Bay Area', '', 30, None, datetime.date(2023, 3, 3), 'Post-IPO', 'United States', 6400, 1),
 ("Bally's Interactive", 'Providence', None, None, '0.15', datetime.date(2023, 1, 18), 'Post-IPO', 'United States', 946, 1),
 ('Carvana', 'Phoenix', '', 2500, '0.12', datetime.date(2022, 5, 10), 'Post-IPO', 'United States', 1600, 1),
 ('Juul', 'SF Bay Area', '', 400, '0.3', datetime.date(2022, 11, 10), 'Unknown', 'United States', 1500, 1),
 ('Airbnb', 'SF Bay Area', '', 30, None, datetime.date(2023, 3, 3), 'Post-IPO', 'United States', 6400, 1)]

We can use the company column to check for the null and blank industry column. This can be done by checking the non-null industry values in a certain company.<br>
By this we will be able to fill the blank industry values using the available company data.<br> For example, we would first check the Airbnb company, to see the appropriate industry

In [34]:
%%sql
SELECT * 
FROM layoffs_staging2 
WHERE company = 'Airbnb';

 * mysql+pymysql://root:***@localhost:3306/worldlayoffs
4 rows affected.

[('Airbnb', 'SF Bay Area', '', 30, None, datetime.date(2023, 3, 3), 'Post-IPO', 'United States', 6400, 1),
 ('Airbnb', 'SF Bay Area', 'Travel', 1900, '0.25', datetime.date(2020, 5, 5), 'Private Equity', 'United States', 5400, 1),
 ('Airbnb', 'SF Bay Area', '', 30, None, datetime.date(2023, 3, 3), 'Post-IPO', 'United States', 6400, 1),
 ('Airbnb', 'SF Bay Area', 'Travel', 1900, '0.25', datetime.date(2020, 5, 5), 'Private Equity', 'United States', 5400, 1)]

From the above query, it is evident that the Airbnb is from the travel industry. This data can be used to populate the blank industry values in that company.<br>
First retrieve the data to check the blank data and which values match to it. This can be done through a self join

In [36]:
%%sql
SELECT *
FROM layoffs_staging2 AS t1
JOIN layoffs_staging2 t2 
	ON t1.company = t2.company 
    AND t1.location = t2.location 
WHERE (t1.industry IS NULL OR t1.industry = '') 
	AND t2.industry IS NOT NULL
LIMIT 10;

 * mysql+pymysql://root:***@localhost:3306/worldlayoffs
10 rows affected.

[('Airbnb', 'SF Bay Area', '', 30, None, datetime.date(2023, 3, 3), 'Post-IPO', 'United States', 6400, 1, 'Airbnb', 'SF Bay Area', '', 30, None, datetime.date(2023, 3, 3), 'Post-IPO', 'United States', 6400, 1),
 ('Airbnb', 'SF Bay Area', '', 30, None, datetime.date(2023, 3, 3), 'Post-IPO', 'United States', 6400, 1, 'Airbnb', 'SF Bay Area', '', 30, None, datetime.date(2023, 3, 3), 'Post-IPO', 'United States', 6400, 1),
 ('Airbnb', 'SF Bay Area', '', 30, None, datetime.date(2023, 3, 3), 'Post-IPO', 'United States', 6400, 1, 'Airbnb', 'SF Bay Area', 'Travel', 1900, '0.25', datetime.date(2020, 5, 5), 'Private Equity', 'United States', 5400, 1),
 ('Airbnb', 'SF Bay Area', '', 30, None, datetime.date(2023, 3, 3), 'Post-IPO', 'United States', 6400, 1, 'Airbnb', 'SF Bay Area', 'Travel', 1900, '0.25', datetime.date(2020, 5, 5), 'Private Equity', 'United States', 5400, 1),
 ('Carvana', 'Phoenix', '', 2500, '0.12', datetime.date(2022, 5, 10), 'Post-IPO', 'United States', 1600, 1, 'Carvana', 'Phoenix', '', 2500, '0.12', datetime.date(2022, 5, 10), 'Post-IPO', 'United States', 1600, 1),
 ('Carvana', 'Phoenix', '', 2500, '0.12', datetime.date(2022, 5, 10), 'Post-IPO', 'United States', 1600, 1, 'Carvana', 'Phoenix', '', 2500, '0.12', datetime.date(2022, 5, 10), 'Post-IPO', 'United States', 1600, 1),
 ('Carvana', 'Phoenix', '', 2500, '0.12', datetime.date(2022, 5, 10), 'Post-IPO', 'United States', 1600, 1, 'Carvana', 'Phoenix', 'Transportation', None, None, datetime.date(2023, 1, 13), 'Post-IPO', 'United States', 1600, 1),
 ('Carvana', 'Phoenix', '', 2500, '0.12', datetime.date(2022, 5, 10), 'Post-IPO', 'United States', 1600, 1, 'Carvana', 'Phoenix', 'Transportation', None, None, datetime.date(2023, 1, 13), 'Post-IPO', 'United States', 1600, 1),
 ('Carvana', 'Phoenix', '', 2500, '0.12', datetime.date(2022, 5, 10), 'Post-IPO', 'United States', 1600, 1, 'Carvana', 'Phoenix', 'Transportation', 1500, '0.08', datetime.date(2022, 11, 18), 'Post-IPO', 'United States', 1600, 1),
 ('Carvana', 'Phoenix', '', 2500, '0.12', datetime.date(2022, 5, 10), 'Post-IPO', 'United States', 1600, 1, 'Carvana', 'Phoenix', 'Transportation', 1500, '0.08', datetime.date(2022, 11, 18), 'Post-IPO', 'United States', 1600, 1)]

We need to update the data with the already available data.<br>
But first, the blank industry values need to be updated to NULL, to make the query easier to run. Having a mixture of blank and null values does not update the values correctly.

In [37]:
%%capture cap --no-stderr
%%sql
UPDATE layoffs_staging2 
SET industry = NULL
WHERE industry = '';
print('blank industry values updated to null')

In [39]:
%%capture cap --no-stderr
%%sql
# Updating the data with missing values
UPDATE layoffs_staging2 AS t1
JOIN layoffs_staging2 t2 
ON t1.company = t2.company 
AND t1.location = t2.location
SET t1.industry = t2.industry 
WHERE t1.industry IS NULL 
AND t2.industry IS NOT NULL;
print('Missing values updated')

This are the total null values that can be updated since there is no extra information provided. <br>
For example, for the `total_laid_off` and `percentage_laid_off`, we could only update it, if we had the total number of employees at the beginning. In this case, if we had the total employees, it would be easier to calculate the `total_laid_off` from the given `percentage_laid_off`.

### Task 4. Remove any columns and rows

Since the row_num column is not needed anymore, it would be better to delete it at this point

In [40]:
%%capture cap --no-stderr
%%sql
ALTER TABLE layoffs_staging2
DROP COLUMN row_num;
print('row_num column deleted')

Since the `total_laid_off` and `percentage_laid_off` columns will be used a lot in the analysis, the null values in those columns will not help much. Therefore, null and blank values in these columns need to be dropped.

In [41]:
%%capture cap --no-stderr
%%sql
DELETE
FROM layoffs_staging2
WHERE total_laid_off IS NULL 
	AND percentage_laid_off IS NULL;
print('null values deleted')

In [42]:
%%sql
# The final cleaned table:
SELECT * FROM layoffs_staging2
LIMIT 10;

 * mysql+pymysql://root:***@localhost:3306/worldlayoffs
10 rows affected.

[('Included Health', 'SF Bay Area', 'Healthcare', None, '0.06', datetime.date(2022, 7, 25), 'Series E', 'United States', 272),
 ('&Open', 'Dublin', 'Marketing', 9, '0.09', datetime.date(2022, 11, 17), 'Series A', 'Ireland', 35),
 ('#Paid', 'Toronto', 'Marketing', 19, '0.17', datetime.date(2023, 1, 27), 'Series B', 'Canada', 21),
 ('100 Thieves', 'Los Angeles', 'Consumer', 12, None, datetime.date(2022, 7, 13), 'Series C', 'United States', 120),
 ('10X Genomics', 'SF Bay Area', 'Healthcare', 100, '0.08', datetime.date(2022, 8, 4), 'Post-IPO', 'United States', 242),
 ('1stdibs', 'New York City', 'Retail', 70, '0.17', datetime.date(2020, 4, 2), 'Series D', 'United States', 253),
 ('2TM', 'Sao Paulo', 'Crypto', 90, '0.12', datetime.date(2022, 6, 1), 'Unknown', 'Brazil', 250),
 ('2TM', 'Sao Paulo', 'Crypto', 100, '0.15', datetime.date(2022, 9, 1), 'Unknown', 'Brazil', 250),
 ('2U', 'Washington D.C.', 'Education', None, '0.2', datetime.date(2022, 7, 28), 'Post-IPO', 'United States', 426),
 ('54gene', 'Washington D.C.', 'Healthcare', 95, '0.3', datetime.date(2022, 8, 29), 'Series B', 'United States', 44)]